

/*
if ( arr.includes('-') = true){
  console.log('ОШИБКА ПРИ ВВОДЕ!!!');
}
else {
    console.log('ВСЁ ОК!!!');
};

/*

const sek = 4000

setTimeout( () => {console.log('Если Вы увидили это, то прошло уже ' + sek/1000 + ' сек. после запуска кода')}, sek)

/* ---------------------------------------------------- 

const newPost = (post, addedAt = Date()) => ({
    ...post,
    addedAt,
});

const firstPost = {
    id: 1,
    author: 'Илья',
};

console.log(newPost(firstPost));


/* ---------------------------------------------------- */

/*
function test(a, b = 2) {
    let c = a * b;
    return c;
};

//let d = test(100);

console.log(test(100));

*/

/* ---------------------------------------------------- */

/*
const d = (a, b = 2) => {
    let c = a * b;
    return c;
};

console.log(d(300,3)); */

/* ---------------------------------------------------- */

/* ---------------------------------------------------- */
// Переписать такую функцию используя синтаксис анонимных 
//функциональных выражений 
/*
const d = function(a, b = 123) {    
    return a * b;
};

console.log(d(4684,2));
*/
/* ---------------------------------------------------- */


